In [31]:
#Handling missing values

In [32]:
import pandas as pd
train_df = pd.read_csv(r'C:\Users\Vaibhav\Desktop\BA\Datasets\titanic_train.csv')
unknown_df = pd.read_csv('C:/Users/Vaibhav/Desktop/BA/Datasets/titanic_test.csv')

In [33]:
train_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [34]:
unknown_df.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [35]:
unknown_df['Survived'] = -888

In [36]:
unknown_df.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,-888
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,-888
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,-888

In [37]:
train_df.shape, unknown_df.shape

((891, 12), (420, 12))

In [38]:
df = pd.concat((train_df, unknown_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [39]:
df.shape

(1311, 12)

In [40]:
df.head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282

In [41]:
df.tail(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
417,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,1309,3,male,1,-888,2668
418,34.5,NaN,Q,7.8292,"Kelly, Mr. James",0,1310,3,male,0,-888,330911
419,47.0,NaN,S,7.0000,"Wilkes, Mrs. James (Ellen Needs)",0,1311,3,female,1,-888,363272

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 12 columns):
Age            1048 non-null float64
Cabin          295 non-null object
Embarked       1309 non-null object
Fare           1310 non-null float64
Name           1311 non-null object
Parch          1311 non-null int64
PassengerId    1311 non-null int64
Pclass         1311 non-null int64
Sex            1311 non-null object
SibSp          1311 non-null int64
Survived       1311 non-null int64
Ticket         1311 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 133.1+ KB

#### Prerequisits for sklearn library:
1. either numpy array or panda dataframe format
2. no missing values
3. all numerical data

Data preprocessing steps:
- structured data
- no missing values
- remove the outliers
- understand the variables which are leading to high variance in the Dependent variable
- understand the inter-correlations between the IVs, because correlated variables are communicating redundant information and lead to over-fitting
- feature engineering

In [43]:
df.isnull().head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,False,True,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,True,False,False,False,False,False,False,False,False,False,False

In [44]:
df.notnull().head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,True,False,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True
2,True,False,True,True,True,True,True,True,True,True,True,True

In [45]:
import numpy as np
df.isnull().sum()

Age             263
Cabin          1016
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived          0
Ticket            0
dtype: int64

In [46]:
df.head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282

In [47]:
df.notnull().head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,True,False,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True
2,True,False,True,True,True,True,True,True,True,True,True,True

In [48]:
np.where(df.Age.isnull())

(array([   5,   17,   19,   26,   28,   29,   31,   32,   36,   42,   45,
          46,   47,   48,   55,   64,   65,   76,   77,   82,   87,   95,
         101,  107,  109,  121,  126,  128,  140,  154,  158,  159,  166,
         168,  176,  180,  181,  185,  186,  196,  198,  201,  214,  223,
         229,  235,  240,  241,  250,  256,  260,  264,  270,  274,  277,
         284,  295,  298,  300,  301,  303,  304,  306,  324,  330,  334,
         335,  347,  351,  354,  358,  359,  364,  367,  368,  375,  384,
         388,  409,  410,  411,  413,  415,  420,  425,  428,  431,  444,
         451,  454,  457,  459,  464,  466,  468,  470,  475,  481,  485,
         490,  495,  497,  502,  507,  511,  517,  522,  524,  527,  531,
         533,  538,  547,  552,  557,  560,  563,  564,  568,  573,  578,
         584,  589,  593,  596,  598,  601,  602,  611,  612,  613,  629,
         633,  639,  643,  648,  650,  653,  656,  667,  669,  674,  680,
         692,  697,  709,  711,  718,  727,  732,  738,  739,  740,  760,
         766,  768,  773,  776,  778,  783,  790,  792,  793,  815,  825,
         826,  828,  832,  837,  839,  846,  849,  859,  863,  868,  878,
         888,  901,  913,  920,  924,  927,  930,  932,  938,  945,  949,
         956,  967,  974,  975,  976,  979,  982,  984,  993,  998,  999,
        1002, 1007, 1012, 1015, 1018, 1023, 1024, 1037, 1039, 1042, 1051,
        1054, 1059, 1061, 1064, 1074, 1079, 1082, 1090, 1091, 1096, 1102,
        1107, 1110, 1116, 1118, 1124, 1134, 1135, 1140, 1146, 1147, 1156,
        1157, 1158, 1159, 1162, 1164, 1165, 1173, 1177, 1179, 1180, 1181,
        1183, 1188, 1192, 1195, 1203, 1223, 1230, 1233, 1235, 1248, 1249,
        1256, 1257, 1271, 1273, 1275, 1299, 1301, 1304, 1307, 1308],
       dtype=int64),)

In [49]:
#name and survival status for all the passengers having missing values in age
df.loc[df.Age.isnull(), ['Name', 'Survived']].tail(3)

                         Name  Survived
413        Spector, Mr. Woolf      -888
416       Ware, Mr. Frederick      -888
417  Peter, Master. Michael J      -888

In [50]:
#to delete all the rows having null values
titanic_nona = df.dropna()

In [51]:
titanic_nona.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 270 entries, 1 to 414
Data columns (total 12 columns):
Age            270 non-null float64
Cabin          270 non-null object
Embarked       270 non-null object
Fare           270 non-null float64
Name           270 non-null object
Parch          270 non-null int64
PassengerId    270 non-null int64
Pclass         270 non-null int64
Sex            270 non-null object
SibSp          270 non-null int64
Survived       270 non-null int64
Ticket         270 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 27.4+ KB

In [52]:
df.Age.isnull().sum()

263

In [53]:
df.Age.mean(skipna=True)

29.901879770992366

In [54]:
df['Age'] = df['Age'].fillna(20)
df['Age'] = df['Age'].fillna(df.Age.mean(skipna=True))
df['Age'] = df['Age'].fillna(df.Age.median(skipna=True))

In [55]:
df[['Age']].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 1 columns):
Age    1311 non-null float64
dtypes: float64(1)
memory usage: 20.5 KB

In [56]:
# how to impute nas for a factor var

In [57]:
df.Embarked.value_counts(dropna=False) #if I do dropna = False, we get the freq of nans

S      915
C      270
Q      124
NaN      2
Name: Embarked, dtype: int64

In [58]:
df.Embarked = df.Embarked.fillna('S')

In [59]:
df[["Fare"]].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 1 columns):
Fare    1310 non-null float64
dtypes: float64(1)
memory usage: 20.5 KB

In [60]:
from sklearn.preprocessing import Imputer

In [61]:
df = pd.concat((train_df, unknown_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [62]:
np.where(df.Age.isnull())

(array([   5,   17,   19,   26,   28,   29,   31,   32,   36,   42,   45,
          46,   47,   48,   55,   64,   65,   76,   77,   82,   87,   95,
         101,  107,  109,  121,  126,  128,  140,  154,  158,  159,  166,
         168,  176,  180,  181,  185,  186,  196,  198,  201,  214,  223,
         229,  235,  240,  241,  250,  256,  260,  264,  270,  274,  277,
         284,  295,  298,  300,  301,  303,  304,  306,  324,  330,  334,
         335,  347,  351,  354,  358,  359,  364,  367,  368,  375,  384,
         388,  409,  410,  411,  413,  415,  420,  425,  428,  431,  444,
         451,  454,  457,  459,  464,  466,  468,  470,  475,  481,  485,
         490,  495,  497,  502,  507,  511,  517,  522,  524,  527,  531,
         533,  538,  547,  552,  557,  560,  563,  564,  568,  573,  578,
         584,  589,  593,  596,  598,  601,  602,  611,  612,  613,  629,
         633,  639,  643,  648,  650,  653,  656,  667,  669,  674,  680,
         692,  697,  709,  711,  718,  727,  732,  738,  739,  740,  760,
         766,  768,  773,  776,  778,  783,  790,  792,  793,  815,  825,
         826,  828,  832,  837,  839,  846,  849,  859,  863,  868,  878,
         888,  901,  913,  920,  924,  927,  930,  932,  938,  945,  949,
         956,  967,  974,  975,  976,  979,  982,  984,  993,  998,  999,
        1002, 1007, 1012, 1015, 1018, 1023, 1024, 1037, 1039, 1042, 1051,
        1054, 1059, 1061, 1064, 1074, 1079, 1082, 1090, 1091, 1096, 1102,
        1107, 1110, 1116, 1118, 1124, 1134, 1135, 1140, 1146, 1147, 1156,
        1157, 1158, 1159, 1162, 1164, 1165, 1173, 1177, 1179, 1180, 1181,
        1183, 1188, 1192, 1195, 1203, 1223, 1230, 1233, 1235, 1248, 1249,
        1256, 1257, 1271, 1273, 1275, 1299, 1301, 1304, 1307, 1308],
       dtype=int64),)

In [63]:
np.where(df.Fare.isnull())

(array([1043], dtype=int64),)

In [64]:
import sklearn

In [65]:
imp = sklearn.preprocessing.Imputer()

C:\Users\Vaibhav\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [66]:
imp = Imputer(strategy = "median") #imp is an instance / object of imputer class
#strategy: mean/ median / most_frequent
#Imputer class can only be used for continuous variables
df[["Fare", "Age"]]=imp.fit_transform(df[["Fare", "Age"]])
#fit method will only find out the respective median values and 
#   transform method will transform the data to impute the NAs with respective median values

C:\Users\Vaibhav\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [67]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket'],
      dtype='object')

In [68]:
df.iloc[1043,3], np.median(df.Fare), df.iloc[5,0], np.median(df.Age)

(14.4542, 14.4542, 28.0, 28.0)

In [69]:
df[["Fare", "Age"]].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 2 columns):
Fare    1311 non-null float64
Age     1311 non-null float64
dtypes: float64(2)
memory usage: 70.7 KB

In [70]:
#fit and transform methods seperately
#fit method will only find out the respective median values and 
#   transform method will transform the data to impute the NAs with respective median values

In [104]:
df = pd.concat((train_df, unknown_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 12 columns):
Age            1048 non-null float64
Cabin          295 non-null object
Embarked       1309 non-null object
Fare           1310 non-null float64
Name           1311 non-null object
Parch          1311 non-null int64
PassengerId    1311 non-null int64
Pclass         1311 non-null int64
Sex            1311 non-null object
SibSp          1311 non-null int64
Survived       1311 non-null int64
Ticket         1311 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 133.1+ KB

In [105]:
imputer = Imputer(missing_values='NaN', strategy = "median", axis = 0)
imputer.fit(df[['Fare', 'Age']]) #this will only compute the median

C:\Users\Vaibhav\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

Imputer(axis=0, copy=True, missing_values='NaN', strategy='median', verbose=0)

In [106]:
df[['Fare', "Age"]].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 2 columns):
Fare    1310 non-null float64
Age     1048 non-null float64
dtypes: float64(2)
memory usage: 30.7 KB

In [76]:
df[df.Age.isnull()]

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
5,NaN,NaN,Q,8.4583,"Moran, Mr. James",0,6,3,male,0,0,330877
17,NaN,NaN,S,13.0000,"Williams, Mr. Charles Eugene",0,18,2,male,0,1,244373
19,NaN,NaN,C,7.2250,"Masselmani, Mrs. Fatima",0,20,3,female,0,1,2649
26,NaN,NaN,C,7.2250,"Emir, Mr. Farred Chehab",0,27,3,male,0,0,2631
28,NaN,NaN,Q,7.8792,"O'Dwyer, Miss. Ellen ""Nellie""",0,29,3,female,0,1,330959
29,NaN,NaN,S,7.8958,"Todoroff, Mr. Lalio",0,30,3,male,0,0,349216
31,NaN,B78,C,146.5208,"Spencer, Mrs. William Augustus (Marie Eugenie)",0,32,1,female,1,1,PC 17569
32,NaN,NaN,Q,7.7500,"Glynn, Miss. Mary Agatha",0,33,3,female,0,1,335677
36,NaN,NaN,C,7.2292,"Mamee, Mr. Hanna",0,37,3,male,0,1,2677
42,NaN,NaN,C,7.8958,"Kraeff, Mr. Theodor",0,43,3,male,0,0,349253
45,NaN,NaN,S,8.0500,"Rogers, Mr. William John",0,46,3,male,0,0,S.C./A.4. 23567
46,NaN,NaN,Q,15.5000,"Lennon, Mr. Denis",0,47,3,male,1,0,370371
47,NaN,NaN,Q,7.7500,"O'Driscoll, Miss. Bridget",0,48,3,female,0,1,14311
48,NaN,NaN,C,21.6792,"Samaan, Mr. Youssef",0,49,3,male,2,0,2662
55,NaN,C52,S,35.5000,"Woolner, Mr. Hugh",0,56,1,male,0,1,19947
64,NaN,NaN,C,27.7208,"Stewart, Mr. Albert A",0,65,1,male,0,0,PC 17605
65,NaN,NaN,C,15.2458,"Moubarek, Master. Gerios",1,66,3,male,1,1,2661
76,NaN,NaN,S,7.8958,"Staneff, Mr. Ivan",0,77,3,male,0,0,349208
77,NaN,NaN,S,8.0500,"Moutal, Mr. Rahamin Haim",0,78,3,male,0,0,374746
82,NaN,NaN,Q,7.7875,"McDermott, Miss. Brigdet Delia",0,83,3,female,0,1,330932
87,NaN,NaN,S,8.0500,"Slocovski, Mr. Selman Francis",0,88,3,male,0,0,SOTON/OQ 392086
95,NaN,NaN,S,8.0500,"Shorney, Mr. Charles Joseph",0,96,3,male,0,0,374910
101,NaN,NaN,S,7.8958,"Petroff, Mr. Pastcho (""Pentcho"")",0,102,3,male,0,0,349215
107,NaN,NaN,S,7.7750,"Moss, Mr. Albert Johan",0,108,3,male,0,1,312991
109,NaN,NaN,Q,24.1500,"Moran, Miss. Bertha",0,110,3,female,1,1,371110
121,NaN,NaN,S,8.0500,"Moore, Mr. Leonard Charles",0,122,3,male,0,0,A4. 54510
126,NaN,NaN,Q,7.7500,"McMahon, Mr. Martin",0,127,3,male,0,0,370372
128,NaN,F E69,C,22.3583,"Peter, Miss. Anna",1,129,3,female,1,1,2668
140,NaN,NaN,C,15.2458,"Boulos, Mrs. Joseph (Sultana)",2,141,3,female,0,0,2678
154,NaN,NaN,S,7.3125,"Olsen, Mr. Ole Martin",0,155,3,male,0,0,Fa 265302
...,...,...,...,...,...,...,...,...,...,...,...,...
268,NaN,NaN,S,8.0500,"Howard, Miss. May Elizabeth",0,1160,3,female,0,-888,A. 2. 39186
271,NaN,NaN,Q,7.7500,"Fox, Mr. Patrick",0,1163,3,male,0,-888,368573
273,NaN,NaN,Q,15.5000,"Lennon, Miss. Mary",0,1165,3,female,1,-888,370371
274,NaN,NaN,C,7.2250,"Saade, Mr. Jean Nassr",0,1166,3,male,0,-888,2676
282,NaN,NaN,Q,7.7500,"Fleming, Miss. Honora",0,1174,3,female,0,-888,364859
286,NaN,NaN,S,7.2500,"Franklin, Mr. Charles (Charles Fardon)",0,1178,3,male,0,-888,SOTON/O.Q. 3101314
288,NaN,F E46,C,7.2292,"Mardirosian, Mr. Sarkis",0,1180,3,male,0,-888,2655
289,NaN,NaN,S,8.0500,"Ford, Mr. Arthur",0,1181,3,male,0,-888,A/5 1478
290,NaN,NaN,S,39.6000,"Rheims, Mr. George Alexander Lucien",0,1182,1,male,0,-888,PC 17607
292,NaN,NaN,C,7.2292,"Nasr, Mr. Mustafa",0,1184,3,male,0,-888,2652
297,NaN,NaN,C,21.6792,"Samaan, Mr. Hanna",0,1189,3,male,2,-888,2662
301,NaN,D,C,15.0458,"Malachard, Mr. Noel",0,1193,2,male,0,-888,237735
304,NaN,NaN,Q,7.7500,"McCarthy, Miss. Catherine Katie""""",0,1196,3,female,0,-888,383123
312,NaN,NaN,S,7.5750,"Sadowitz, Mr. Harry",0,1204,3,male,0,-888,LP 1588
332,NaN,NaN,C,7.2250,"Thomas, Mr. Tannous",0,1224,3,male,0,-888,2684
339,NaN,NaN,C,7.2292,"Betros, Master. Seman",0,1231,3,male,0,-888,2622
342,NaN,NaN,S,69.5500,"Sage, Mr. John George",9,1234,3,male,1,-888,CA. 2343
344,NaN,NaN,S,14.5000,"van Billiard, Master. James William",1,1236,3,male,1,-888,A/5. 851
357,NaN,NaN,S,7.8792,"Lockyer, Mr. Edward",0,1249,3,male,0,-888,1222
358,NaN,NaN,Q,7.7500,"O'Keefe, Mr. Patrick",0,1250,3,male,0,-888,368402
365,NaN,NaN,S,69.5500,"Sage, Mrs. John (Annie Bullen)",9,1257,3,female,1,-888,CA. 2343
366,NaN,NaN,C,14.4583,"Caram, Mr. Joseph",0,1258,3,male,1,-888,2689
380,NaN,NaN,Q,7.7500,"O'Connor, Mr. Patrick",0,1272,3,male,0,-888,366713
382,NaN,NaN,S,14.5000,"Risien, Mrs. Samuel (Emma)",0,1274,3,female,0,-888,364498
384,NaN,NaN,S,12.8750,"Wheeler, Mr. Edwin Frederick""""",0,1276,2,male,0,-888,SC/PARIS 2159
408,NaN,NaN,Q,7.7208,"Riordan, Miss. Johanna Hannah""""",0,1300,3,female,0,-888,334915
410,NaN,NaN,Q,7.7500,"Naughton, Miss. Hannah",0,1302,3,female,0,-888,365237
413,NaN,NaN,S,8.0500,"Spector, Mr. Woolf",0,1305,3,male,0,-888,A.5. 3236
416,NaN,NaN,S,8.0500,"Ware, Mr. Frederick",0,1308,3,male,0,-888,359309
417,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,1309,3,male,1,-888,2668

In [78]:
df.median(axis = 0)#reduce on rows - and get the column wise mean

Age             28.0000
Fare            14.4542
Parch            0.0000
PassengerId    656.0000
Pclass           3.0000
SibSp            0.0000
Survived         0.0000
dtype: float64

In [107]:
df[['Fare', 'Age']] = imputer.transform(df[['Fare', 'Age']]) #to transform the column Fare

In [108]:
df.iloc[1043,3], df.Fare.median(skipna=True), df.iloc[5,0], df.Age.median(skipna=True)

(14.4542, 14.4542, 28.0, 28.0)

In [109]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 12 columns):
Age            1311 non-null float64
Cabin          295 non-null object
Embarked       1309 non-null object
Fare           1311 non-null float64
Name           1311 non-null object
Parch          1311 non-null int64
PassengerId    1311 non-null int64
Pclass         1311 non-null int64
Sex            1311 non-null object
SibSp          1311 non-null int64
Survived       1311 non-null int64
Ticket         1311 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 173.1+ KB

In [44]:
df = pd.concat((train_df, unknown_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [45]:
df.Age.isnull().sum()

263

In [46]:
#if it is female (i.e for the missing value of age) - then the median age of the female 
#will be imputed and if it male, then the median age of males will be imputed
df.groupby('Sex').Age. median()

Sex
female    27.0
male      28.0
Name: Age, dtype: float64

In [47]:
df.Age = df.groupby('Sex').Age.transform('median')

In [48]:
df.Age.isnull().sum() #Age imputed by the median age represented by the sex

0

In [49]:
df.groupby("Pclass").Age.mean()

Pclass
1    27.554180
2    27.617329
3    27.694796
Name: Age, dtype: float64

In [50]:
df.groupby('Pclass').Age.transform('mean')

0      27.694796
1      27.554180
2      27.694796
3      27.554180
4      27.694796
5      27.694796
6      27.554180
7      27.694796
8      27.694796
9      27.617329
10     27.694796
11     27.554180
12     27.694796
13     27.694796
14     27.694796
15     27.617329
16     27.694796
17     27.617329
18     27.694796
19     27.694796
20     27.617329
21     27.617329
22     27.694796
23     27.554180
24     27.694796
25     27.694796
26     27.694796
27     27.554180
28     27.694796
29     27.694796
         ...
390    27.554180
391    27.554180
392    27.694796
393    27.617329
394    27.694796
395    27.554180
396    27.694796
397    27.554180
398    27.694796
399    27.694796
400    27.554180
401    27.617329
402    27.554180
403    27.554180
404    27.554180
405    27.617329
406    27.617329
407    27.554180
408    27.694796
409    27.694796
410    27.694796
411    27.554180
412    27.694796
413    27.694796
414    27.554180
415    27.694796
416    27.694796
417    27.694796
418    27.694796
419    27.694796
Name: Age, Length: 1311, dtype: float64

In [51]:
#replace the median age according to the title

In [52]:
df.Name[:3]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
Name: Name, dtype: object

In [53]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket'],
      dtype='object')

In [54]:
name = df.iloc[0, 4]

In [55]:
name

'Braund, Mr. Owen Harris'

In [56]:
name.split(",")[1].split(".")[0].lower()

' mr'

In [57]:
def GetTitle(name):
    title = name.split(',')[1].split('.')[0].lower()
    
        
    
    return(title)

In [58]:
GetTitle(name)

' mr'

In [59]:
df['Title'] = df.Name.map(lambda x: GetTitle(x))

In [60]:
df.Title.value_counts()

 mr              758
 miss            260
 mrs             198
 master           61
 dr                8
 rev               8
 col               4
 mlle              2
 major             2
 ms                2
 capt              1
 sir               1
 the countess      1
 dona              1
 lady              1
 mme               1
 don               1
 jonkheer          1
Name: Title, dtype: int64

In [61]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Title'],
      dtype='object')

In [62]:
df.Title

0           mr
1          mrs
2         miss
3          mrs
4           mr
5           mr
6           mr
7       master
8          mrs
9          mrs
10        miss
11        miss
12          mr
13          mr
14        miss
15         mrs
16      master
17          mr
18         mrs
19         mrs
20          mr
21          mr
22        miss
23          mr
24        miss
25         mrs
26          mr
27          mr
28        miss
29          mr
        ...
390         mr
391        mrs
392     master
393         mr
394         mr
395        mrs
396         mr
397        mrs
398         mr
399         mr
400       miss
401         mr
402       miss
403         mr
404         mr
405         mr
406         mr
407         mr
408       miss
409       miss
410       miss
411        mrs
412       miss
413         mr
414       dona
415         mr
416         mr
417     master
418         mr
419        mrs
Name: Title, Length: 1311, dtype: object

In [63]:
df.Title.unique()

array([' mr', ' mrs', ' miss', ' master', ' don', ' rev', ' dr', ' mme',
       ' ms', ' major', ' lady', ' sir', ' mlle', ' col', ' capt',
       ' the countess', ' jonkheer', ' dona'], dtype=object)

In [64]:

title_group = { 'mr' : 'Mr',
               'mrs' : 'Mrs',
               'miss':'Miss',
               'master': 'Master',
               'don': 'Sir',
               'rev': 'Sir',
               'dr': 'Officer',
               'mme': 'Mrs',
               'ms': 'Mrs',
               'major': 'Officer',
               'lady': 'Lady',
               'sir': 'Sir',
               'mlle': 'Miss',
               'col': 'Officer',
               'capt': 'Officer',
               'the countess': 'Lady',
               'jonkheer': 'Sir',
               'dona': 'Lady'}

In [65]:
title_group['master']

'Master'

In [66]:
def GetTitle(name):
    title = name.split(',')[1].split('.')[0].strip().lower()
    
    
    title_group = { 'mr' : 'Mr',
               'mrs' : 'Mrs',
               'miss':'Miss',
               'master': 'Master',
               'don': 'Sir',
               'rev': 'Sir',
               'dr': 'Officer',
               'mme': 'Mrs',
               'ms': 'Mrs',
               'major': 'Officer',
               'lady': 'Lady',
               'sir': 'Sir',
               'mlle': 'Miss',
               'col': 'Officer',
               'capt': 'Officer',
               'the countess': 'Lady',
               'jonkheer': 'Sir',
               'dona': 'Lady'}
        
    
    return(title_group[title])

In [67]:
name
title = name.split(',')[1].split('.')[0].strip().lower()
title

'mr'

In [68]:
GetTitle(name)

'Mr'

In [69]:
df['Title']=df.Name.map(lambda x: GetTitle(x))

In [70]:
df['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Sir', 'Officer', 'Lady'],
      dtype=object)

In [71]:
df.Title.value_counts()

Mr         758
Miss       262
Mrs        201
Master      61
Officer     15
Sir         11
Lady         3
Name: Title, dtype: int64

In [72]:
df.groupby("Title").Age.median()

Title
Lady       27.0
Master     28.0
Miss       27.0
Mr         28.0
Mrs        27.0
Officer    28.0
Sir        28.0
Name: Age, dtype: float64

In [73]:
df.groupby(['Title',"Pclass"]).Age.median().unstack()

Pclass      1     2     3
Title
Lady     27.0   NaN   NaN
Master   28.0  28.0  28.0
Miss     27.0  27.0  27.0
Mr       28.0  28.0  28.0
Mrs      27.0  27.0  27.0
Officer  28.0  28.0   NaN
Sir      28.0  28.0   NaN

In [74]:
df.groupby(['Title',"Pclass"]).Fare.transform('median')[:3]

0     7.8958
1    78.1125
2     8.0500
Name: Fare, dtype: float64

In [75]:
df.Cabin.unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148', 'B45', 'B36', 'A21', 'D34', 'A9', 'C31', 'B61', 'C53',
       'D43', 'C130', 'C132', 'C55 C57', 'C116', 'F', 'A29', 'C6', 'C28',
       'C51', 'C97', 'D22', 'B10', 'E45', 'E52', 'A11', 'B11', 'C80',
       'C89', 'F E46', 'B26', 'F E57', 'A18', 'E60', 'E39 E41',
       'B52 B54 B56', 'C39', 'B24', 'D40', 'D38', 'C105'], dtype=object)

In [76]:
np.sum(df[['Cabin']].isnull())

Cabin    1016
dtype: int64

In [77]:
df[df.Cabin=='T']

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title
339,28.0,T,S,35.5,"Blackwell, Mr. Stephen Weart",0,340,1,male,0,0,113784,Mr

In [78]:
df.loc[df.Cabin=='T', 'Cabin'] = np.NaN

In [79]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Title'],
      dtype='object')

In [80]:
deck  = df.iloc[1,1]
deck

'C85'

In [81]:
deck[0].upper()

'C'

In [82]:
np.where(df.Cabin.notnull(), 'x', 'y') #where-ever true is returned by the condition, put x else put y

array(['y', 'x', 'y', ..., 'y', 'y', 'y'], dtype='<U1')

In [83]:
np.where(pd.notnull(deck), str(deck)[0].upper(), 'Z')

array('C', dtype='<U1')

In [84]:
def getdeck(deck):
    a = np.where(pd.notnull(deck), str(deck)[0].upper(), 'Z')
    return a

In [85]:
df['Deck'] = df['Cabin'].map(lambda x: getdeck(x))

In [86]:
print(df.Deck[:6])

0    Z
1    C
2    Z
3    C
4    Z
5    Z
Name: Deck, dtype: object

In [87]:
#crosstab to find the survival rate according to cabin
pd.crosstab(df[df.Survived!= -888].Survived , df[df.Survived!= -888].Deck)
# We have to find out if deck is a significant variable in predicting the survival rate. This can be predicted only if as the deck varies, survival rate varies significantly

Deck      A   B   C   D   E  F  G    Z
Survived
0         8  12  24   8   8  5  2  482
1         7  35  35  25  24  8  2  206

In [88]:
#survival rate for deck A? 7/15
7/15

0.4666666666666667

In [89]:
35/47

0.7446808510638298

In [90]:
24/59

0.4067796610169492